fonecmid-diplom/src/DataProcessors/ВКМ_МассовоеСозданиеАктов/ВКМ_МассовоеСозданиеАктов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ВКМ_МассовоеСозданиеАктов</name>
  <attributes>
    <name>Период</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокСозданныхРеализацийУслуг</name>
    <attributes>
      <name>Договор</name>
      <type>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>СсылкаНаРеализацию</name>
      <type>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

fonecmid-diplom/src/Documents/РеализацияТоваровУслуг/РеализацияТоваровУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РеализацияТоваровУслуг</name>
  <registerRecords>AccumulationRegister.ОстаткиТоваров</registerRecords>
  <registerRecords>AccumulationRegister.ОбработкаЗаказов</registerRecords>
  <registerRecords>AccumulationRegister.ВКМ_ВыполненныеКлиентуРаботы</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Услуги</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/DataProcessors/ВКМ_МассовоеСозданиеАктов/ManagerModule.bsl
#Если Сервер  Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Создает или обновляет документы реализации для всех договоров в табличной части
//
// Параметры:
//   Период - Дата - месяц, за который создаются документы
//   Таблица - ТаблицаЗначений - копия ТЧ СписокСозданныхРеализацийУслуг
//   
// Возвращаемое значение:
//   ТаблицаЗначений - содержит договоры и ссылки на созданные документы реализации
//
Функция СоздатьИлиОбновитьРеализации(Период, Таблица) Экспорт
	
	РезультатТаблица = Новый ТаблицаЗначений;
	РезультатТаблица.Колонки.Добавить("Договор");
	РезультатТаблица.Колонки.Добавить("СсылкаНаРеализацию");
	Для Каждого СтрокаТаблицы Из Таблица Цикл
		
		Если ЗначениеЗаполнено(СтрокаТаблицы.СсылкаНаРеализацию) Тогда
			ДокументОбъект = СтрокаТаблицы.СсылкаНаРеализацию.ПолучитьОбъект();
			ДокументОбъект.ВКМ_ВыполнитьАвтозаполнение();
			ДокументОбъект.Записать();
			ДокументОбъект.ПроверитьЗаполнение();
			ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
			Если ДокументОбъект.Услуги.Количество() > 0 Тогда
				НоваяСтрока = РезультатТаблица.Добавить();
				НоваяСтрока.Договор = СтрокаТаблицы.Договор;
				НоваяСтрока.СсылкаНаРеализацию = ДокументОбъект.Ссылка;
			КонецЕсли;
		Иначе 
			ДокументОбъект = Документы.РеализацияТоваровУслуг.СоздатьДокумент();
			ДокументОбъект.Дата = КонецМесяца(Период);
			ДокументОбъект.Организация = СтрокаТаблицы.Договор.Организация;
			ДокументОбъект.Контрагент = СтрокаТаблицы.Договор.Владелец;
			ДокументОбъект.Договор = СтрокаТаблицы.Договор;
			ДокументОбъект.ВКМ_ВыполнитьАвтозаполнение();
			ДокументОбъект.Записать();
			ДокументОбъект.ПроверитьЗаполнение();
			ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
			Если ДокументОбъект.Услуги.Количество() > 0 Тогда
				НоваяСтрока = РезультатТаблица.Добавить();
				НоваяСтрока.Договор = СтрокаТаблицы.Договор;
				НоваяСтрока.СсылкаНаРеализацию = ДокументОбъект.Ссылка;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
		
	Возврат РезультатТаблица;  
	
КонецФункции

#КонецОбласти

#КонецЕсли
